<?php
/**
 * @copyright
 */

namespace Ufocms\AdminModules\Widgets;

/**
 * Widget class
 */
class WeatherGismeteo extends \Ufocms\AdminModules\Widget
{
    /**
     * @see parent
     */
    protected function setFields()
    {
        $this->fields = array(
            array('Type' => 'combo',    'Name' => 'Url',        'Value' => '',  'Title' => 'Путь к источнику данных',           'Edit' => true,     'Items' => 'getSource'),
            array('Type' => 'list',     'Name' => 'Lifetime',   'Value' => 60,  'Title' => 'Запрашивать данные через, мин.',    'Edit' => true,     'Items' => 'getLifetime'),
        );
    }
    
    /**
     * @return array
     */
    protected function getSource()
    {
        
        $cities = array(
            27612 => 'Москва',
            27611 => 'Наро-Фоминск',
            26062 => 'С.-Петербург',
            29865 => 'Абакан',
            22550 => 'Архангельск',
            34880 => 'Астрахань',
            29838 => 'Барнаул',
            34214 => 'Белгород',
            31510 => 'Благовещенск',
            26898 => 'Брянск',
            31960 => 'Владивосток',
            37228 => 'Владикавказ',
            27532 => 'Владимир',
            34560 => 'Волгоград',
            27037 => 'Вологда',
            34122 => 'Воронеж',
            36052 => 'Горно-Алтайск',
            37235 => 'Грозный',
            37470 => 'Дербент',
            28440 => 'Екатеринбург',
            27347 => 'Иваново',
            28411 => 'Ижевск',
            99990 => 'Йошкар-Ола',
            30710 => 'Иркутск',
            27595 => 'Казань',
            26702 => 'Калининград',
            27703 => 'Калуга',
            37116 => 'Карачаевск',
            29642 => 'Кемерово',
            27196 => 'Киров',
            27333 => 'Кострома',
            34929 => 'Краснодар',
            29574 => 'Красноярск',
            28116 => 'Кудымкар',
            28661 => 'Курган',
            34009 => 'Курск',
            36096 => 'Кызыл',
            27930 => 'Липецк',
            25913 => 'Магадан',
            37021 => 'Майкоп',
            37472 => 'Махачкала',
            37054 => 'Мин.Воды',
            22113 => 'Мурманск',
            37212 => 'Нальчик',
            28506 => 'Набер.Челны',
            99946 => 'Назрань',
            23848 => 'Нефтеюганск',
            23471 => 'Нижневартовск',
            27553 => 'Н.Новгород',
            26179 => 'Новгород',
            37006 => 'Новороссийск',
            29634 => 'Новосибирск',
            23078 => 'Норильск',
            28698 => 'Омск',
            27906 => 'Орел',
            35121 => 'Оренбург',
            27962 => 'Пенза',
            28225 => 'Пермь',
            22820 => 'Петрозаводск',
            32540 => 'Петроп.-Камч',
            26258 => 'Псков',
            37050 => 'Пятигорск',
            34731 => 'Ростов-на-Д',
            27731 => 'Рязань',
            28900 => 'Самара',
            27760 => 'Саранск',
            34172 => 'Саратов',
            26781 => 'Смоленск',
            37099 => 'Сочи',
            34949 => 'Ставрополь',
            23849 => 'Сургут',
            23804 => 'Сыктывкар',
            27947 => 'Тамбов',
            27402 => 'Тверь',
            27890 => 'Тольятти',
            29430 => 'Томск',
            27719 => 'Тула',
            28367 => 'Тюмень',
            30823 => 'Улан-Удэ',
            27786 => 'Ульяновск',
            28722 => 'Уфа',
            31735 => 'Хабаровск',
            23933 => 'Ханты-Манс',
            27581 => 'Чебоксары',
            28642 => 'Челябинск',
            30758 => 'Чита',
            34861 => 'Элиста',
            32150 => 'Ю.-Сахалинск',
            24959 => 'Якутск',
            27331 => 'Ярославль',
            36870 => 'Алма-Ата',
            35188 => 'Астана',
            38880 => 'Ашхабад',
            37850 => 'Баку',
            38353 => 'Бишкек',
            26730 => 'Вильнюс',
            38836 => 'Душанбе',
            37789 => 'Ереван',
            33345 => 'Киев',
            33815 => 'Кишинев',
            26850 => 'Минск',
            26422 => 'Рига',
            26038 => 'Таллинн',
            38457 => 'Ташкент',
            37549 => 'Тбилиси',
        );
        $arr = [];
        foreach ($cities as $key => $val) {
            $arr[] = ['Value' => 'http://informer.gismeteo.ru/xml/' . $key . '.xml', 'Title' => $val];
        }
        return $arr;
    }
    
    /**
     * @return array
     */
    protected function getLifetime()
    {
        $items = array();
        for ($i = 10; $i <= 240; $i += 10) {
            $items[] = array('Value' => $i, 'Title' => $i);
        }
        return $items;
    }
}
